// //створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// function rectangleAre(a,b){
//     return a*b
// }
// rectangleAre(3,2)
// console.log(rectangleAre(3,2));
// document.write(`<h3>Площа прямокутника - ${rectangleAre(3,2)}</h3>`)
// // //___________________________________________________________________________________________
// // //створити функцію яка обчислює та повертає площу кола з радіусом r
// function circle (a){
//     return 2 * Math.PI * a
// }
// circle(2)
// document.write(`<h3>Площа кола - ${circle(2)}</h3>`)
// //_________________________________________________________________________________________________
// //створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// function cylinder (r, h){
//     return 2 * Math.PI * r * h;
// }
// cylinder(2,5)
// console.log(cylinder(2,5));
// document.write(`<h3>Площа циліндра - ${cylinder(2,5)}</h3>`)
//_____________________________________________________________________________________________________
//створити функцію яка приймає масив та виводить кожен його елемент
// let massif1 = [25,35,45,55,'hey','how are you?'];
// function noName(){
// }
// let Var = noName(console.log(massif1));
//______________________________________________________________________________________________________
// створити функцію яка створює параграф з текстом. Текст задати через аргумент
// function text(){
//    console.log(arguments);
// }
// text('hello, this is a paragraph with some uninteresting text')
//__________________________________________________________________________________________________
//створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// function liInUl (){
//     for (let i = 0; i < 3; i++) {
//        console.log(i);
//        document.write(`<ul><li>Some text</li></ul>`)
//     }
// }
// liInUl()
//__________________________________________________________________________________________________________
//створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
// Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)

